2gua.rainbow-brackets
aaron-bond.better-comments
adpyke.codesnap
akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
alefragnani.pascal
alefragnani.pascal-formatter
alefragnani.project-manager
anysphere.cursorpyright
anysphere.pyright
anysphere.remote-containers
anysphere.remote-ssh
arcticicestudio.nord-visual-studio-code
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
cweijan.vscode-office
davidanson.vscode-markdownlint
docker.docker
donjayamanne.githistory
donjayamanne.python-environment-manager
dsznajder.es7-react-js-snippets
esbenp.prettier-vscode
github.github-vscode-theme
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.gemini-cli-vscode-ide-companion
hediet.vscode-drawio
intellsmi.comment-translate
ionutvmi.path-autocomplete
james-yu.latex-workshop
kdarkhan.mips
kevinrose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
luniclynx.bison
luniclynx.lex
maoguangming.cool
mattn.lisp
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mhutchie.git-graph
mitaki28.vscode-clang
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-zh-hans
ms-python.black-formatter
ms-python.debugpy
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-repositories
myriad-dreamin.tinymist
narasimapandiyan.jetbrainsmono
njpwerner.autodocstring
oderwat.indent-rainbow
orangex4.hsnips
pkief.material-icon-theme
pomdtr.excalidraw-editor
redhat.fabric8-analytics
redhat.java
redjue.git-commit-plugin
rust-lang.rust-analyzer
sdras.night-owl
shd101wyy.markdown-preview-enhanced
sjhuangx.vscode-scheme
sst-dev.opencode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
techer.open-in-browser
tomoki1207.pdf
uloco.theme-bluloco-light
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vstirbu.vscode-mermaid-preview
wakatime.vscode-wakatime
wangguixuan.var-translate-en
xabikos.javascriptsnippets
zhuangtongfa.material-theme
zhwu95.riscv
